sysbench_test_PostgreSQL_Mixed.log
========================================
Sysbench Test Parameters:
TABLES=20, TABLE_SIZE=500000, THREADS=32, TIME=600, REPORT_INTERVAL=10
========================================
[1/3] Preparing data...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=20 --table-size=500000 prepare
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 500000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 500000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 500000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 500000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 500000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 500000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 500000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 500000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 500000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 500000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
Creating table 'sbtest11'...
Inserting 500000 records into 'sbtest11'
Creating a secondary index on 'sbtest11'...
Creating table 'sbtest12'...
Inserting 500000 records into 'sbtest12'
Creating a secondary index on 'sbtest12'...
Creating table 'sbtest13'...
Inserting 500000 records into 'sbtest13'
Creating a secondary index on 'sbtest13'...
Creating table 'sbtest14'...
Inserting 500000 records into 'sbtest14'
Creating a secondary index on 'sbtest14'...
Creating table 'sbtest15'...
Inserting 500000 records into 'sbtest15'
Creating a secondary index on 'sbtest15'...
Creating table 'sbtest16'...
Inserting 500000 records into 'sbtest16'
Creating a secondary index on 'sbtest16'...
Creating table 'sbtest17'...
Inserting 500000 records into 'sbtest17'
Creating a secondary index on 'sbtest17'...
Creating table 'sbtest18'...
Inserting 500000 records into 'sbtest18'
Creating a secondary index on 'sbtest18'...
Creating table 'sbtest19'...
Inserting 500000 records into 'sbtest19'
Creating a secondary index on 'sbtest19'...
Creating table 'sbtest20'...
Inserting 500000 records into 'sbtest20'
Creating a secondary index on 'sbtest20'...
[2/3] Running benchmark...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=20 --table-size=500000 --threads=32 --time=600 --report-interval=10 run
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 2773.36 qps: 55526.23 (r/w/o: 38873.29/11102.13/5550.81) lat (ms,95%): 17.32 err/s: 0.20 reconn/s: 0.00
[ 20s ] thds: 32 tps: 2592.52 qps: 51863.96 (r/w/o: 36305.12/10371.89/5186.95) lat (ms,95%): 18.95 err/s: 0.70 reconn/s: 0.00
[ 30s ] thds: 32 tps: 2614.99 qps: 52289.71 (r/w/o: 36604.37/10454.56/5230.78) lat (ms,95%): 18.28 err/s: 0.20 reconn/s: 0.00
[ 40s ] thds: 32 tps: 2400.10 qps: 48024.48 (r/w/o: 33615.59/9607.00/4801.90) lat (ms,95%): 21.89 err/s: 0.60 reconn/s: 0.00
[ 50s ] thds: 32 tps: 2653.31 qps: 53062.35 (r/w/o: 37146.31/10608.63/5307.42) lat (ms,95%): 17.95 err/s: 0.20 reconn/s: 0.00
[ 60s ] thds: 32 tps: 2386.61 qps: 47744.51 (r/w/o: 33419.98/9550.12/4774.41) lat (ms,95%): 23.52 err/s: 0.40 reconn/s: 0.00
[ 70s ] thds: 32 tps: 2600.31 qps: 52023.87 (r/w/o: 36416.09/10405.35/5202.43) lat (ms,95%): 19.65 err/s: 0.50 reconn/s: 0.00
[ 80s ] thds: 32 tps: 2394.78 qps: 47895.30 (r/w/o: 33528.59/9575.94/4790.77) lat (ms,95%): 22.28 err/s: 0.30 reconn/s: 0.00
[ 90s ] thds: 32 tps: 2470.31 qps: 49411.81 (r/w/o: 34586.95/9883.64/4941.22) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 2297.99 qps: 45961.10 (r/w/o: 32175.59/9187.84/4597.67) lat (ms,95%): 25.28 err/s: 0.40 reconn/s: 0.00
[ 110s ] thds: 32 tps: 2501.82 qps: 50044.13 (r/w/o: 35028.63/10011.17/5004.33) lat (ms,95%): 19.65 err/s: 0.10 reconn/s: 0.00
[ 120s ] thds: 32 tps: 2346.75 qps: 46905.93 (r/w/o: 32835.15/9376.39/4694.39) lat (ms,95%): 23.10 err/s: 0.10 reconn/s: 0.00
[ 130s ] thds: 32 tps: 2220.32 qps: 44431.34 (r/w/o: 31104.94/8884.57/4441.83) lat (ms,95%): 26.68 err/s: 0.20 reconn/s: 0.00
[ 140s ] thds: 32 tps: 2446.91 qps: 48934.94 (r/w/o: 34253.46/9787.35/4894.12) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 32 tps: 2377.62 qps: 47568.03 (r/w/o: 33295.53/9516.77/4755.73) lat (ms,95%): 20.74 err/s: 0.20 reconn/s: 0.00
[ 160s ] thds: 32 tps: 2093.66 qps: 41867.37 (r/w/o: 29311.59/8367.25/4188.53) lat (ms,95%): 28.67 err/s: 0.30 reconn/s: 0.00
[ 170s ] thds: 32 tps: 2175.54 qps: 43523.72 (r/w/o: 30462.70/8709.04/4351.97) lat (ms,95%): 22.69 err/s: 0.10 reconn/s: 0.00
[ 180s ] thds: 32 tps: 2013.00 qps: 40244.48 (r/w/o: 28174.09/8043.50/4026.90) lat (ms,95%): 29.72 err/s: 0.20 reconn/s: 0.00
[ 190s ] thds: 32 tps: 2429.39 qps: 48605.09 (r/w/o: 34023.35/9722.26/4859.48) lat (ms,95%): 20.37 err/s: 0.20 reconn/s: 0.00
[ 200s ] thds: 32 tps: 2342.21 qps: 46835.93 (r/w/o: 32785.66/9364.35/4685.92) lat (ms,95%): 21.11 err/s: 0.50 reconn/s: 0.00
[ 210s ] thds: 32 tps: 2187.31 qps: 43760.61 (r/w/o: 30634.88/8750.42/4375.31) lat (ms,95%): 27.66 err/s: 0.20 reconn/s: 0.00
[ 220s ] thds: 32 tps: 2233.19 qps: 44664.36 (r/w/o: 31265.33/8931.85/4467.18) lat (ms,95%): 24.83 err/s: 0.20 reconn/s: 0.00
[ 230s ] thds: 32 tps: 2295.11 qps: 45903.27 (r/w/o: 32129.32/9183.53/4590.42) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 2245.25 qps: 44910.42 (r/w/o: 31439.42/8980.00/4491.00) lat (ms,95%): 27.66 err/s: 0.10 reconn/s: 0.00
[ 250s ] thds: 32 tps: 2412.84 qps: 48259.80 (r/w/o: 33783.33/9649.28/4827.19) lat (ms,95%): 21.11 err/s: 0.20 reconn/s: 0.00
[ 260s ] thds: 32 tps: 2259.11 qps: 45167.67 (r/w/o: 31615.52/9032.83/4519.32) lat (ms,95%): 21.89 err/s: 0.20 reconn/s: 0.00
[ 270s ] thds: 32 tps: 2252.79 qps: 45073.15 (r/w/o: 31551.03/9015.75/4506.38) lat (ms,95%): 23.10 err/s: 0.20 reconn/s: 0.00
[ 280s ] thds: 32 tps: 2165.90 qps: 43329.82 (r/w/o: 30330.25/8667.08/4332.49) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 32 tps: 2160.11 qps: 43189.13 (r/w/o: 30232.86/8635.35/4320.92) lat (ms,95%): 24.83 err/s: 0.20 reconn/s: 0.00
[ 300s ] thds: 32 tps: 2339.53 qps: 46801.13 (r/w/o: 32762.04/9359.73/4679.36) lat (ms,95%): 21.50 err/s: 0.10 reconn/s: 0.00
[ 310s ] thds: 32 tps: 2103.95 qps: 42090.86 (r/w/o: 29464.44/8417.11/4209.31) lat (ms,95%): 24.83 err/s: 0.40 reconn/s: 0.00
[ 320s ] thds: 32 tps: 2163.61 qps: 43273.59 (r/w/o: 30290.84/8654.44/4328.32) lat (ms,95%): 23.95 err/s: 0.20 reconn/s: 0.00
[ 330s ] thds: 32 tps: 2119.21 qps: 42399.10 (r/w/o: 29677.84/8481.84/4239.42) lat (ms,95%): 26.20 err/s: 0.30 reconn/s: 0.00
[ 340s ] thds: 32 tps: 2126.08 qps: 42519.68 (r/w/o: 29767.10/8499.52/4253.06) lat (ms,95%): 29.19 err/s: 0.30 reconn/s: 0.00
[ 350s ] thds: 32 tps: 2272.11 qps: 45436.53 (r/w/o: 31806.36/9085.65/4544.52) lat (ms,95%): 23.52 err/s: 0.10 reconn/s: 0.00
[ 360s ] thds: 32 tps: 2158.49 qps: 43189.85 (r/w/o: 30231.89/8639.27/4318.68) lat (ms,95%): 24.38 err/s: 0.50 reconn/s: 0.00
[ 370s ] thds: 32 tps: 2342.10 qps: 46840.94 (r/w/o: 32790.26/9365.59/4685.09) lat (ms,95%): 24.38 err/s: 0.20 reconn/s: 0.00
[ 380s ] thds: 32 tps: 2280.80 qps: 45621.65 (r/w/o: 31934.64/9123.81/4563.21) lat (ms,95%): 23.95 err/s: 0.50 reconn/s: 0.00
[ 390s ] thds: 32 tps: 2631.71 qps: 52646.69 (r/w/o: 36852.50/10529.66/5264.53) lat (ms,95%): 20.00 err/s: 0.30 reconn/s: 0.00
[ 400s ] thds: 32 tps: 2803.84 qps: 56092.00 (r/w/o: 39264.99/11216.94/5610.07) lat (ms,95%): 17.63 err/s: 0.70 reconn/s: 0.00
[ 410s ] thds: 32 tps: 2563.85 qps: 51273.18 (r/w/o: 35891.68/10252.40/5129.10) lat (ms,95%): 21.89 err/s: 0.30 reconn/s: 0.00
[ 420s ] thds: 32 tps: 2674.18 qps: 53496.93 (r/w/o: 37449.77/10697.41/5349.75) lat (ms,95%): 18.95 err/s: 0.40 reconn/s: 0.00
[ 430s ] thds: 32 tps: 2618.63 qps: 52350.68 (r/w/o: 36644.27/10467.74/5238.67) lat (ms,95%): 20.74 err/s: 0.50 reconn/s: 0.00
[ 440s ] thds: 32 tps: 2652.49 qps: 53089.54 (r/w/o: 37162.49/10620.57/5306.48) lat (ms,95%): 20.00 err/s: 0.20 reconn/s: 0.00
[ 450s ] thds: 32 tps: 2573.78 qps: 51465.82 (r/w/o: 36027.26/10289.00/5149.55) lat (ms,95%): 21.50 err/s: 0.80 reconn/s: 0.00
[ 460s ] thds: 32 tps: 2544.63 qps: 50920.40 (r/w/o: 35646.55/10182.80/5091.05) lat (ms,95%): 22.28 err/s: 0.60 reconn/s: 0.00
[ 470s ] thds: 32 tps: 2801.69 qps: 56025.97 (r/w/o: 39217.14/11205.25/5603.58) lat (ms,95%): 18.28 err/s: 0.20 reconn/s: 0.00
[ 480s ] thds: 32 tps: 2612.44 qps: 52254.48 (r/w/o: 36580.35/10448.16/5225.98) lat (ms,95%): 20.37 err/s: 0.10 reconn/s: 0.00
[ 490s ] thds: 32 tps: 2602.16 qps: 52058.45 (r/w/o: 36441.57/10410.85/5206.02) lat (ms,95%): 21.11 err/s: 0.50 reconn/s: 0.00
[ 500s ] thds: 32 tps: 2583.89 qps: 51679.19 (r/w/o: 36173.86/10336.96/5168.38) lat (ms,95%): 20.37 err/s: 0.10 reconn/s: 0.00
[ 510s ] thds: 32 tps: 2441.50 qps: 48836.92 (r/w/o: 34187.65/9765.88/4883.39) lat (ms,95%): 18.28 err/s: 0.10 reconn/s: 0.00
[ 520s ] thds: 32 tps: 2628.12 qps: 52570.94 (r/w/o: 36799.01/10514.29/5257.64) lat (ms,95%): 20.37 err/s: 0.40 reconn/s: 0.00
[ 530s ] thds: 32 tps: 2674.99 qps: 53495.18 (r/w/o: 37445.65/10698.66/5350.88) lat (ms,95%): 19.29 err/s: 0.30 reconn/s: 0.00
[ 540s ] thds: 32 tps: 2411.40 qps: 48249.25 (r/w/o: 33775.64/9648.21/4825.41) lat (ms,95%): 25.28 err/s: 0.50 reconn/s: 0.00
[ 550s ] thds: 32 tps: 2433.94 qps: 48682.48 (r/w/o: 34078.02/9735.38/4869.09) lat (ms,95%): 24.83 err/s: 0.20 reconn/s: 0.00
[ 560s ] thds: 32 tps: 2565.14 qps: 51295.41 (r/w/o: 35908.67/10255.06/5131.68) lat (ms,95%): 20.74 err/s: 0.40 reconn/s: 0.00
[ 570s ] thds: 32 tps: 2745.30 qps: 54916.05 (r/w/o: 38442.46/10981.39/5492.19) lat (ms,95%): 17.95 err/s: 0.30 reconn/s: 0.00
[ 580s ] thds: 32 tps: 2830.82 qps: 56625.63 (r/w/o: 39637.00/11325.39/5663.24) lat (ms,95%): 18.61 err/s: 0.40 reconn/s: 0.00
[ 590s ] thds: 32 tps: 2747.28 qps: 54947.90 (r/w/o: 38468.02/10983.42/5496.46) lat (ms,95%): 18.95 err/s: 0.50 reconn/s: 0.00
[ 600s ] thds: 32 tps: 2615.72 qps: 52322.21 (r/w/o: 36622.89/10466.98/5232.34) lat (ms,95%): 20.00 err/s: 0.10 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            20443794
        write:                           5840403
        other:                           2920879
        total:                           29205076
    transactions:                        1460099 (2433.40 per sec.)
    queries:                             29205076 (48673.17 per sec.)
    ignored errors:                      172    (0.29 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0236s
    total number of events:              1460099

Latency (ms):
         min:                                  4.80
         avg:                                 13.15
         max:                                848.97
         95th percentile:                     21.89
         sum:                            19195460.74

Threads fairness:
    events (avg/stddev):           45628.0938/75.01
    execution time (avg/stddev):   599.8581/0.01

[3/3] Cleaning up...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=20 --table-size=500000 cleanup
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
Dropping table 'sbtest11'...
Dropping table 'sbtest12'...
Dropping table 'sbtest13'...
Dropping table 'sbtest14'...
Dropping table 'sbtest15'...
Dropping table 'sbtest16'...
Dropping table 'sbtest17'...
Dropping table 'sbtest18'...
Dropping table 'sbtest19'...
Dropping table 'sbtest20'...
========================================
Sysbench full test completed. Results saved to sysbench_test_20241221_143145.log